Программирование в 1С – за 21 день/День 18/Documents/ВыпискаБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВыпискаБанка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccountingRegister.РегистрБухУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПриходДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Программирование в 1С – за 21 день/День 18/Documents/ВыпискаБанка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.РегистрБухУчет.Записывать = Истина;
	
	// регистр Взаиморасчеты Расход
	Для Каждого ТекСтрокаПриходДенежныхСредств Из ПриходДенежныхСредств Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаПриходДенежныхСредств.Контрагент;
		Движение.Сумма = ТекСтрокаПриходДенежныхСредств.Сумма;
		
	// регистр РегистрБухУчет 
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.РасчетныйСчет;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Покупатели;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаПриходДенежныхСредств.Сумма;
	КонецЦикла;
	
	Для Каждого ТекСтрокаРасходДенежныхСредств Из РасходДенежныхСредств Цикл
		
	// регистр Взаиморасчеты Приход
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаРасходДенежныхСредств.Контрагент;
		Движение.Сумма = ТекСтрокаРасходДенежныхСредств.Сумма;
		
	// регистр РегистрБухУчет 
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Поставщики;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.РасчетныйСчет;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаРасходДенежныхСредств.Сумма;
	КонецЦикла;

КонецПроцедуры
